Repository: kagrawal-tibco/svnToGit
Catalog: designtime/webstudio/ui/src/locale/messages_*.xlf
Languages: es

source: Fail to add column: The primitive field {{displayValue}} is immutable. The Action column can not be created with this name.
es: Error al agregar la columna: el campo primitivo {{displayValue}} es inmutable. La columna Acción no se puede crear con este nombre.

source: Fail to add column: please make sure all fields are entered correctly.
es: No se pudo agregar la columna: asegúrese de que todos los campos se hayan ingresado correctamente.

source: Fail to add column: {{displayValue}}. This column already present
es: No se pudo agregar la columna: {{displayValue}}. Esta columna ya está presente.

source: Successfully Completed
es: Completado correctamente

source: Are you sure you want discard the changes on this page.
es: ¿Está seguro de que quiere descartar los cambios en esta página?

source: Page: {{0}} of {{1}}
es: Página: {{0}} de {{1}}

source: Select widget for string bindings in Rule Template Instance
es: Seleccionar widget para enlaces de cadena en instancia de Rule Template

source: (working)
es: (de trabajo)

source: Enter role for the project...
es: Introducir rol para el proyecto...

source: Remove role from the project.
es: Elimine el rol del proyecto.

source: You cannot delete the only role associated with the project.
es: No puede eliminar el único rol asociado con el proyecto.

source: You cannot delete the only role associated with the user.
es: No puede eliminar el único rol asociado con el usuario.

source: No External Artifacts to synchronize.
es: No hay artefactos externos para sincronizar.

source: No stale commits.
es: Sin confirmaciones obsoletas.

source: No rejected commits.
es: Sin confirmaciones rechazadas.

source: No approved commits.
es: Sin confirmaciones aprobadas.

source: No Stale Checked-out Artifact.
es: Sin artefactos en checkout obsoletos.

source: Nothing loaded yet
es: Todavía no se ha cargado nada

source: No commit in this project.
es: Sin confirmaciones en este proyecto.

source: Number of recently opened items
es: Número de elementos abiertos recientemente

source: Create Artifact
es: Crear artefacto

source: Import Artifact
es: Importar artefacto

source: No rows to show
es: No hay filas para mostrar

source: There are {{errorCount}} error(s) and {{warningCount}} warning(s) found.
es: Se encontraron {{errorCount}} errores y {{warningCount}} advertencias.

source: Clear
es: Borrar

source: ON
es: ENCENDIDO

source: OFF
es: APAGADO

source: Condition
es: Condición

source: TextArea
es: Área de texto

source: TextBox
es: Cuadro de texto

source: Pending review
es: Pendiente de revisión

source: {{val}} days ago
es: Hace {{val}} días

source: {{val}} day ago
es: Hace {{val}} día

source: {{val}} hours ago
es: Hace {{val}} horas

source: {{val}} hour ago
es: Hace {{val}} hora

source: {{val}} minutes ago
es: Hace {{val}} minutos

source: {{val}} minute ago
es: Hace {{val}} minuto

source: {{val}} seconds ago
es: Hace {{val}} segundos

source: {{val}} second ago
es: Hace {{val}} segundo

source: {{getDeployableArtifacts}} deployable artifact(s)
es: {{getDeployableArtifacts}} artefacto(s) implementable(s)

source: {{getDeployableArtifacts}} unresolved worklist item(s)
es: {{getDeployableArtifacts}} elementos de la lista de trabajo sin resolver

source: Import a project from a ZIP file
es: Importar un proyecto desde un archivo ZIP

source: Login
es: Iniciar sesión

source: Modify
es: Modificar

source: Synchronize
es: Sincronizar

source: Logout
es: Cerrar sesión

source: Build And Deploy
es: Compilar e implementar

source: Generate Deployable
es: Generar implementable

source: External Synchronize
es: Sincronización externa

source: Group
es: Grupo

source: Preferences
es: Preferencias

source: Deployment Config
es: Configuración de implementación

source: Lock
es: Bloquear

source: UnLock
es: Desbloquear

source: Worklist
es: Lista de trabajo

source: Loading...
es: Cargando...

source: Filter...
es: Filtro...

source: Columns
es: Columnas

source: Filters
es: Filtros

source: Drag here to set new row groups
es: Arrastrar aquí para establecer nuevos grupos de filas

source: Pivot Mode
es: Modo de pivote

source: Groups
es: Grupos

source: Values
es: Valores

source: Pivots
es: Pivotes

source: Drag columns to aggregate
es: Arrastrar columnas para agregar

source: Drag here
es: Arrastrar aquí

source: Hide non-checked out projects
es: Ocultar proyectos sin checkout

source: Project Snapshots
es: Instantáneas del proyecto

source: Checkout Project Now
es: Checkout del proyecto ahora

source: Delete Project
es: Eliminar proyecto

source: Unresolved worklist item(s)
es: Elementos de la lista de trabajo sin resolver

source: Deployable artifact(s)
es: Artefactos implementables

source: View Project Details
es: Ver detalles del proyecto

source: Search for projects or artifacts
es: Buscar proyectos o artefactos

source: You cannot delete currently the user who is currently logged in.
es: No puede eliminar ahora el usuario que está conectado actualmente.

source: Options
es: Opciones

source: Just now
es: Ahora mismo

source: Select DateTime
es: Seleccionar fecha y hora

source: Matches
es: Coincidencias

source: Before
es: Antes

source: After
es: Después

source: Between
es: Entre

source: Show additional filter options
es: Mostrar opciones de filtro adicionales

source: View Commit
es: Ver commit

source: View Metadata
es: Ver metadatos

source: current
es: actual

source: In-memory
es: En memoria

source: In-memory:
es: En memoria:

source: User Name
es: Nombre de usuario
