Repository: kagrawal-tibco/svnToGit
Catalog: designtime/webstudio/ui/src/locale/messages_*.xlf
Languages: es

source: Locks
es: Bloqueos

source: Report Management
es: Administración de informes

source: Change Password
es: Cambiar contraseña

source: Minimum length: 4
es: Longitud mínima: 4

source: clusterName is {{0}}required{{1}}
es: El nombre del clúster es {{0}}obligatorio{{1}}

source: clusterName cannot consists {{0}}spaces{{!}}
es: El nombre del clúster no puede contener {{0}}espacios{{!}}

source: Confirm Password
es: Confirmar contraseña

source: Passwords are not same.
es: Las contraseñas no son las mismas.

source: Add User
es: Agregar usuario

source: Passwords are not same
es: Las contraseñas no son las mismas

source: Assign Role to User
es: Asignar rol

source: Username is {{0}}required{{1}}.
es: El nombre de usuario es {{0}}obligatorio{{1}}.

source: Username {{0}} already exists.{{1}}
es: El nombre de usuario {{0}} ya existe.{{1}}

source: Username cannot consists {{0}} spaces {{1}}.
es: El nombre de usuario no puede contener {{0}} espacios {{1}}.

source: Role is {{0}}required{{1}}.
es: El rol es {{0}}obligatorio{{1}}.

source: Password is {{0}}required.{{1}}
es: La contraseña es {{0}}obligatoria.{{1}}

source: Password cannot consists {{0}}spaces.{{1}}
es: La contraseña no puede contener {{0}}espacios.{{1}}

source: Create User.
es: Cree un usuario.

source: Add role to the project.
es: Agregue un rol al proyecto.

source: Remove user from the selected role.
es: Elimine el usuario del rol seleccionado.

source: Assign user to this role
es: Asignar usuario a este rol

source: Resources
es: Recursos

source: Actions
es: Acciones

source: List of Locked Artifacts
es: Lista de artefactos bloqueados

source: Unlock All
es: Desbloquear todo

source: No artifacts are locked for the selected project.
es: No hay artefactos bloqueados para el proyecto seleccionado.

source: Artifact Details
es: Detalles del artefacto

source: Path:
es: Ruta:

source: File Type:
es: Tipo de archivo:

source: Lock Owner:
es: Propietario del bloqueo:

source: Lock Time:
es: Tiempo de bloqueo:

source: Lock:
es: Bloquear:

source: warning
es: advertencia

source: User Settings
es: Configuración de usuario

source: Personal Preferences
es: Preferencias personales

source: Projects Configuration
es: Configuración de proyectos

source: Account Settings
es: Configuración de la cuenta

source: User Settings
es: Configuración de usuario

source: Application Settings
es: Configuración de aplicación

source: Operator Preferences
es: Preferencias del operador

source: Notification Preferences
es: Preferencias de notificación

source: Deployment Preferences
es: Preferencias de implementación

source: Account Information
es: Información de la cuenta

source: Connected Identities
es: Identidades conectadas

source: No Identity Provider Account is connected.
es: Ninguna cuenta de usuario está conectada.

source: Projects Configuration
es: Configuración de proyectos

source: No projects available with your permission setup.
es: No hay proyectos disponibles con su configuración de permiso.

source: Show In Explorer
es: Mostrar en el explorador

source: Loading Bussiness Events project preferences...
es: Cargando las preferencias del proyecto de Business Events...

source: Preferences
es: Preferencias

source: Only display checked out artifacts in Project Explorer
es: Solo muestra los artefactos en checkout en el explorador de proyectos

source: Always highlight differences in Artifact Editor
es: Resaltar siempre las diferencias en el editor de artefactos

source: Automatically validate artifacts when saving changes
es: Validar automáticamente los artefactos al guardar cambios

source: Show empty folders when filtering artifacts
es: Mostrar carpetas vacías cuando se filtren artefactos

source: Display notifications when work list items have changed status
es: Mostrar notificaciones cuando los elementos de la lista de trabajo hayan cambiado de estado

source: Preferences
es: Preferencias

source: Tree
es: Árbol

source: List
es: Lista

source: Basic Tree (no groups)
es: Árbol básico (sin grupos)

source: Match Any
es: Emparejar cualquiera

source: Match All
es: Emparejar todos

source: Match None
es: No emparejar ninguno

source: Number of recently opened items to be displayed is {{0}}required{{1}}.
es: El número de elementos abiertos recientemente que se mostrarán es {{0}}obligatorio{{1}}.

source: Number of recently opened items to be dispalyed cannot be {{0}}smaller than 1{{1}}.
es: El número de elementos abiertos recientemente que se deben mostrar no puede ser {{0}}inferior a 1{{1}}.

source: Number of recently opened items to be dispalyed cannot be {{0}}larger than 25{{1}}.
es: El número de elementos abiertos recientemente que se deben mostrar no puede ser {{0}}superior a 25{{1}}.

source: SCS User Name
es: Nombre de usuario SCS

source: SCS User Password
es: Contraseña de usuario SCS

source: View Project
es: Ver proyecto

source: Decision Table Page Size
es: Tamaño de página de la tabla de decisiones

source: Descision table page size is {{0}}required{{1}}.
es: El tamaño de página de la tabla de decisiones es {{0}}obligatorio{{1}}.

source: Descision table page size cannot be larger than {{0}}500{{1}}.
es: El tamaño de página de la tabla de decisiones no puede ser superior a {{0}}500{{1}}.

source: Descision table page size cannot be smaller than {{0}}10{{1}}.
es: El tamaño de página de la tabla de decisiones no puede ser inferior a {{0}}10{{1}}.

source: Default Rule Template Instance Filter
es: Filtro de instancia de Rule Template predeterminada

source: Auto Unlock On Approve/Reject
es: Desbloqueo automático al aprobar/rechazar

source: Group Related Artifacts
es: Agrupar artefactos relacionados

source: Allow Custom Domain Values
es: Permitir valores de dominio personalizados

source: Show Column Alias If Present
es: Mostrar alias de columna si está presente

source: Email ID
es: Identificador de correo electrónico

source: Edit email-id
es: Editar identificador de correo electrónico

source: Delete email-id.
es: Elimine el identificador de correo electrónico.

source: No email-id(s) registered with this project for receiving notifications.
es: No se han registrado correos electrónicos con este proyecto para recibir notificaciones.

source: Field Type
es: Tipo de campo

source: Filter Operators
es: Operadores de filtro

source: Command Operators
es: Operadores de comando

source: Add deployment preference
es: Agregar preferencia de implementación

source: Edit deployment preference
es: Editar preferencia de implementación

source: Cluster name is {{0}}required{{1}}.
es: El nombre del clúster es {{0}}obligatorio{{1}}.

source: Cluster name cannot consists {{0}}spaces{{1}}.
es: El nombre del clúster no puede contener {{0}}espacios{{1}}.

source: Name is {{0}}required{{1}}.
es: El nombre es {{0}}obligatorio{{1}}.

source: Name cannot consists {{0}}spaces{{1}}.
es: El nombre no puede contener {{0}}espacios{{1}}.

source: Project is {{0}}required{{1}}.
es: El proyecto es {{0}}obligatorio{{1}}.

source: Host is {{0}}required{{1}}.
es: El host es {{0}}obligatorio{{1}}.

source: Host cannot consists {{0}}spaces{{1}}.
es: El host no puede contener {{0}}espacios{{1}}.

source: Port should be a {{0}} non-negative number{{1}}.
es: El puerto debe ser un {{0}} número no negativo{{1}}.

source: Agent name is {{0}}required{{1}}.
es: El nombre del agente es {{0}}obligatorio{{1}}.

source: Agent name cannot consists {{0}}spaces{{1}}.
es: El nombre del agente no puede contener {{0}}espacios{{1}}.

source: Duplicate Configuration,select another project for configuration.
es: Configuración duplicada, seleccione otro proyecto para la configuración.

source: Enable
es: Habilitar

source: Port
es: Puerto

source: Cluster Name
es: Nombre del clúster

source: Agent Name
es: Nombre del agente

source: Deployments
es: Implementaciones

source: Create new deployment preferences.
es: Crear nuevas preferencias de implementación.

source: Update deployment configuration.
es: Actualizar la configuración de implementación.

source: Delete deployment configuration.
es: Elimine la configuración de implementación.

source: No deployment configurations are available.
es: No hay configuraciones de implementación disponibles.

source: Configuration Details
es: Detalles de configuración

source: Name:
es: Nombre:

source: Project:
es: Proyecto:

source: Enabled:
es: Habilitado:

source: Port:
es: Puerto:

source: User Name:
es: Nombre de usuario:

source: Password:
es: Contraseña:

source: Cluster Name:
es: Nombre del clúster:

source: Agent Name:
es: Nombre del agente:

source: Basic tree navigation (no groups)
es: Navegación básica en árbol (sin grupos)

source: Show resources as a tree
es: Mostrar recursos como árbol

source: Show resources as a flattened list
es: Mostrar recursos como lista plana

source: Show breadcrumbs
es: Mostrar breadcrumbs

source: New Artifact...
es: Nuevo artefacto...

source: Commit...
es: Confirmar...

source: Force pull
es: Forzar inserción

source: Synchronize...
es: Sincronizar...

source: Validate
es: Validar

source: Sync To Repository
es: Sincronizar con el repositorio

source: History
es: Historial

source: More
es: Más

source: Info
es: Información

source: Download
es: Descargar

source: Hide
es: Ocultar

source: Revert
es: Revertir

source: New Business Rule
es: Nueva regla de negocios

source: New Decision Table
es: Nueva tabla de decisiones

source: Text Editor
es: Editor de texto

source: Metadata Editor
es: Editor de metadatos

source: StreamBase Decision Table Editor
es: Editor de tabla de decisiones de StreamBase

source: Switch to
es: Cambiar a

source: Open with
es: Abrir con

source: Discard Local Changes
es: Descartar cambios locales

source: Unlock
es: Desbloquear

source: Lock...
es: Bloquear...

source: Rename
es: Cambiar nombre

source: Replace with
es: Sustituir por

source: Upload File...
es: Cargar archivo...

source: Latest Revision
es: Última revisión

source: Older Revision...
es: Revisión anterior...

source: Deployment
es: Implementación

source: Add Instance
es: Agregar instancia

source: Delete Instance
es: Eliminar instancia

source: Read
es: Lectura

source: Manage Locks
es: Administrar bloqueos

source: Deployment History
es: Historial de implementación

source: Generate Deploy
es: Generar implementación

source: Manage Descriptors
es: Administrar descriptores

source: This artifact's type does not support synchronization. Would you like to discard your local changes and replace the local artifact with the latest revision from the server?
es: El tipo de este artefacto no es compatible con la sincronización. ¿Desea descartar los cambios locales y sustituir el artefacto local por la última revisión del servidor?

source: Filtering {{0}} artifacts
es: Filtrado de {{0}} artefactos

source: Enter filter text...
es: Introducir texto del filtro...

source: Edit Group...
es: Editar grupo…

source: Stop Sharing Group
es: Dejar de compartir grupo

source: Share Group
es: Compartir grupo

source: Delete Group
es: Eliminar grupo

source: Checkout/Import Project
es: Checkout/Importar proyecto

source: Add New Artifacts
es: Agregar nuevos artefactos

source: Path
es: Ruta

source: Location
es: Ubicación

source: Type
es: Tipo

source: Delete All Problems.
es: Elimine todos los problemas.

source: Size (KB)
es: Tamaño (KB)

source: Artifacts
es: Artefactos

source: New field
es: Nuevo campo

source: ID
es: Identificador

source: CONDITION
es: CONDICIÓN

source: ACTION
es: ACCIÓN

source: Business Rules
es: Reglas del negocio

source: Decision Tables
es: Tablas de decisiones

source: All Projects
es: Todos los proyectos

source: All Artifacts
es: Todos los artefactos

source: Create new deployment descriptor for [{{name}}]
es: Crear nuevo descriptor de implementación para [{{name}}]

source: Please confirm you want to cancel the scheduled deployment.
es: Confirme que desea cancelar la implementación programada.

source: Unable to recognize status: {{err}}
es: No se puede reconocer el estado: {{err}}

source: Unable to recognize target type: {{type}}
es: No se puede reconocer el tipo de destino: {{type}}

source: Revisions shall be specified when in edit mode.
es: Las revisiones se especificarán en el modo de edición.

source: Shall have some version specified
es: Debe tener alguna versión especificada

source: Shall not save when not in create mode
es: No debe guardarse cuando no esté en modo de creación

source: Please confirm you want to remove the deployment descriptor
es: Confirme que desea eliminar el descriptor de implementación

source: Deployment succeeded at {{0}}.
es: Implementación correcta a las {{0}}.

source: Deployment failed at {{0}}.
es: Error de implementación en {{0}}.

source: Deployment started at {{0}}.
es: La implementación comenzó a las {{0}}.

source: Deployment is still pending.
es: La implementación aún está pendiente.

source: Deployment was cancelled at {{0}}
es: La implementación se canceló a las {{0}}

source: Manage Deployment Descriptors of {{name}}
es: Administrar los descriptores de implementación de {{name}}

source: Fail to refresh editor because: {{reason}}
es: Error al actualizar el editor. Motivo: {{reason}}

source: Failed to save because: {{err}}
es: Error al guardar. Motivo: {{err}}

source: This artifact's type does not support synchronization. Would you like to discard you local changes and replace the local artifact with the latest revision from the server?
es: El tipo de este artefacto no es compatible con la sincronización. ¿Desea descartar los cambios locales y sustituir el artefacto local por la última revisión del servidor?

source: Replace
es: Sustituir

source: You already have an on-going Verify session with this artifact.
es: Ya tienes una sesión de verificación en curso con este artefacto.

source: No errors/warning found.
es: No se encontraron errores/advertencias.

source: This artifact's type does not support synchronization. Would you like to discard your local changes and replace the local artifact with the latest revision from the server?
es: El tipo de este artefacto no es compatible con la sincronización. ¿Desea descartar los cambios locales y sustituir el artefacto local por la última revisión del servidor?

source: Unable to recognize editor interface
es: No se puede reconocer la interfaz del editor

source: Delete selected error/warning.
es: Elimine el error/advertencia seleccionado.

source: Delete all errors and warnings.
es: Elimine todos los errores y advertencias.

source: Do you want to delete all entries? Deleted entries can be recreated by validating corresponding artifact/project or may not be recoverable.
es: ¿Desea eliminar todas las entradas? Las entradas eliminadas se pueden volver a crear al validar el artefacto/proyecto correspondiente o pueden no ser recuperables.

source: Do you want to delete selected entries? Deleted entries can be recreated by validating corresponding artifact or may not be recoverable.
es: ¿Desea eliminar las entradas seleccionadas? Las entradas eliminadas se pueden volver a crear mediante la validación del artefacto correspondiente o pueden no ser recuperables.

source: This artifact is not checked out
es: Este artefacto no está en checkout

source: Range filter values should not be empty
es: Los valores del filtro de rango no deben estar vacíos

source: Failure
es: Error

source: An error occurred while renaming artifact.
es: Se ha producido un error al cambiar el nombre de artefacto.

source: Resource name can contain letters, numbers, and underscore only. It should start with a letter and be less than 64 characters
es: El nombre del recurso puede contener solamente letras, números y guiones bajos. Debe comenzar con una letra y tener menos de 64 caracteres.

source: Do you want to delete all entries? Deleted entries can be recreated by validating corresponding artifact/project or may not be recoverable.
es: ¿Desea eliminar todas las entradas? Las entradas eliminadas se pueden volver a crear al validar el artefacto/proyecto correspondiente o pueden no ser recuperables.

source: Do you want to delete selected entries? Deleted entries can be recreated by validating corresponding artifact or may not be recoverable.
es: ¿Desea eliminar las entradas seleccionadas? Las entradas eliminadas se pueden volver a crear mediante la validación del artefacto correspondiente o pueden no ser recuperables.

source: {{name}}'s base has been updated to catch up changes in the repository.
es: La base de {{name}} se ha actualizado para recuperar los cambios en el repositorio.

source: {{name}} has changes, do you want to save them?
es: {{name}} tiene cambios. ¿Quiere guardarlos?

source: Create artifact
es: Crear artefacto

source: Create folder
es: Crear carpeta

source: Create artifact inside of current selection
es: Crear artefacto dentro de la selección actual

source: Create folder inside of current selection
es: Crear carpeta dentro de la selección actual

source: Unable to read {{name}} because:
es: No se puede leer {{name}} porque:

source: Please enter a valid Identity Nickname.
es: Introduzca un apodo de identidad válido.

source: Invalid form is passed from signup page
es: Se ha pasado u formulario no válido desde página de registro

source: Please repeat the password correctly.
es: Repita la contraseña correctamente.

source: Please enter username and password correctly.
es: Introduzca su nombre de usuario y contraseña correctamente.

source: A user profile for [{{username}}] was created.
es: Se creó un perfil de usuario para [{{username}}].

source: A user profile for [{{username}}] was created but is currently disabled. Please contact the administrator to activate your profile.
es: Se creó un perfil de usuario para [{{username}}] pero actualmente está deshabilitado. Póngase en contacto con el administrador para activar su perfil.

source: Only zip files can be imported. Add your project directory to a zip file and name it with the project name.
es: Solo se pueden importar archivos ZIP. Agregue el directorio de su proyecto a un archivo ZIP y asígnele el nombre del proyecto.

source: Project shall not be empty
es: El proyecto no debe estar vacío

source: Discard
es: Descartar

source: Click Confirm to revert changes to selected artifacts. Any local changes will be lost and cannot be recovered.
es: Haga clic en Confirmar para revertir los cambios a los artefactos seleccionados. Cualquier cambio local se perderá y no se podrá recuperar.

source: No available artifact for review.
es: No hay ningún artefacto disponible para su revisión.

source: ViewDiff is supported for Decision table and Business rule only.
es: ViewDiff solo es compatible con la tabla de decisiones y la regla de negocios.

source: The commit candidate has been deleted.
es: El candidato de confirmación ha sido eliminado.

source: Something is wrong. Cannot sync commit candidate which is in committed status
es: Algo va mal. No se puede sincronizar un candidato de confirmación que está en estado confirmado

source: No deployment environment configured for this project.
es: Ningún entorno de implementación configurado para este proyecto.

source: Select all
es: Seleccionar todo

source: Unselect all
es: Deseleccionar todo

source: Find
es: Encontrar

source: Type in search box to see results...
es: Escriba en el cuadro de búsqueda para ver los resultados...

source: Nothing found...
es: No se ha encontrado nada...

source: All Enviornment selected
es: Todo el ambiente seleccionado

source: Commit with revision Id of [{{id}}] is successfully delegated
es: La confirmación con el identificador de revisión [{{id}}] se ha delegado correctamente

source: Missing roles to delegate to.
es: Faltan roles a los cuales delegar.

source: Missing deployment environment
es: Falta el entorno de implementación

source: Please confirm you want to withdraw the commit.
es: Confirme que desea retirar la confirmación.

source: Do you want to delete entry with revisionId
es: ¿Desea eliminar la entrada con identificador de revisión?

source: Changes to Artifact
es: Cambios en el artefacto

source: New Artifact
es: Nuevo artefacto

source: Artifact [{{path}}] successfully deployed
es: Artefacto [{{path}}] implementado correctamente

source: There are {{0}} error(s) and {{1}} warning(s) found. Open the artifact and run validate for more information.
es: Se encontraron {{0}} errores y {{1}} advertencias. Abra el artefacto y ejecute la validación para obtener más información.

source: Cannot update artifact which is not cached.
es: No se puede actualizar un artefacto que no está en caché.

source: Unable to get artifact revision for id: {{id}}, revision:
es: No se puede obtener la revisión del artefacto para el identificador: {{id}}, revisión:

source: Unable to get Checked-out Artifact for id {{id}}
es: No se puede obtener el artefacto en checkout para el identificador {{id}}

source: Fail to find parent of this checkout.
es: No se pudo encontrar el elemento principal de este checkout.

source: Cannot invoke sync external for non-checked-out artifact.
es: No se puede invocar la sincronización externa para artefactos que no están en checkout.

source: Unable to find checked-out artifact for id:
es: No se puede encontrar el artefacto en checkout para el identificador:

source: You do not have the management permission.
es: No tiene el permiso de administración.

source: Unable to find the project meta in cache, something is wrong
es: No se puede encontrar el metaproyecto en la memoria caché, algo va mal

source: Unable to deserialize Artifact Analysis Result: {{raw}}
es: No se puede anular la serialización del resultado del análisis de artefactos: {{raw}}

source: Fail to get build info because: {{err}}
es: No se pudo obtener información de la compilación porque: {{err}}

source: Error response with a success http status code: {{res}}
es: Respuesta de error con un código de estado http correcto: {{res}}

source: Error downloading file {{file}}
es: Error al descargar el archivo {{file}}

source: Error connecting to server. TIBCO BusinessEvents WebStudio Server has shut down.
es: Error al conectarse al servidor. TIBCO BusinessEvents WebStudio Server se ha apagado.

source: socket error because:
es: error de socket porque:

source: Establish WebSocket connection successfully
es: Conexión de WebSocket establecida correctamente

source: Browser does not support WebSocket, notifiaction service might not be usable.
es: El navegador no es compatible con WebSocket, es posible que el servicio de notificación no sea utilizable.

source: {{artifactName}} has invalid metadata:
es: {{artifactName}} tiene metadatos no válidos:

source: Server Error:
es: Error del servidor:

source: Server Error: Authentication Failed. Please retry or contact the server administrator.
es: Error del servidor: error de autenticación. Vuelva a intentarlo o póngase en contacto con el administrador del servidor.

source: Error downloading file
es: Error al descargar el archivo

source: Locking not enabled
es: Bloqueo no habilitado

source: Lock successfully acquired
es: Bloqueo adquirido correctamente

source: Failed to acquire Lock. Lock already acquired by '{{0}}'
es: Error al adquirir el bloqueo. Bloqueo ya adquirido por '{{0}}'

source: Failed to acquire Lock
es: Error al adquirir el bloqueo

source: Lock successfully released
es: Bloqueo correctamente liberado

source: Failed to release the Lock
es: Error al liberar el bloqueo

source: WebSocket are not supported, notifiaction service might not be usable.
es: WebSocket no es compatible, el servicio de notificación podría no ser utilizable.

source: Check out an existing project
es: Checkout de un proyecto existente

source: Change user settings
es: Cambiar configuración de usuario

source: Edit artifacts
es: Editar artefactos
