Repository: kagrawal-tibco/svnToGit
Catalog: designtime/webstudio/ui/src/locale/messages_*.xlf
Languages: es

source: Click for details
es: Haga clic para obtener más detalles

source: Cancel
es: Cancelar

source: Confirm
es: Confirmar

source: Add Column to Decision Table
es: Agregar columna a la tabla de decisión

source: Custom Type
es: Tipo personalizado

source: Select Columns
es: Seleccionar columnas

source: Column Name
es: Nombre de columna

source: Column
es: Columna

source: Column {{columnName}} already exists.
es: La columna {{columnName}} ya existe.

source: Column Type
es: Tipo de columna

source: Property Type
es: tipo de propiedad

source: Column Field Setting
es: Configuración de campo de columna

source: Column Alias
es: Alias de columna

source: Column Id
es: Identificador de columna

source: Default Text
es: Texto predeterminado

source: Value
es: Valor

source: Description
es: Descripción

source: Include existing rules
es: Incluir reglas existentes

source: Ok
es: Aceptar

source: Operators
es: Operadores

source: Fields
es: Campos

source: Current Concept Fields
es: Campos conceptuales actuales

source: Loading Date Time Picker....
es: Cargando el selector de fecha y hora…

source: Add parameters to
es: Agregar parámetros a

source: Added
es: Agregado

source: Deleted
es: Eliminado

source: Modified
es: Modificado

source: Properties
es: Propiedades

source: Problems
es: Problemas

source: Verify
es: Verificar

source: Test Data
es: Datos de prueba

source: Loading RTI When...
es: Cargando RTI cuando...

source: When
es: Cuando

source: Loading RTI Then...
es: Cargando RTI y...

source: Then
es: Entonces

source: Synchronize Project
es: Sincronizar proyecto

source: Close
es: Cerrar

source: Artifact is unlocked
es: El artefacto está desbloqueado

source: Artifact is locked
es: El artefacto esta bloqueado

source: Start a Verify Session
es: Iniciar una sesión de verificación

source: Configuration
es: Configuración

source: Display the result in JSON format.
es: Muestre el resultado en formato JSON.

source: Only show the Action Schema fields.
es: Mostrar solo los campos del esquema de acción.

source: Commit Changes to Project
es: Confirmar cambios en el proyecto

source: Message
es: Mensaje

source: Artifact History
es: Historial del artefacto

source: No History For This Artifact.
es: No hay historial para este artefacto.

source: Checked-Out Artifacts of Project
es: Artefactos del proyecto en checkout

source: Synchronize External changes to Project
es: Sincronizar cambios externos al proyecto

source: Deployment Configuration
es: Configuración de implementación

source: Schedule a future start time of deployment
es: Programar una hora de inicio futura de la implementación

source: Deploy Time
es: Hora de implementación

source: Deploy time is required if you want to schedule the deployment to start in the future.
es: La hora de implementación es necesaria si desea programar la implementación para que se inicie en el futuro.

source: Deploy time can only be sometime in the future.
es: La hora de implementación solo puede futura.

source: New Deployment Descriptor
es: Nuevo descriptor de implementación

source: Loading
es: Cargando

source: Copy this descriptor to create a new one
es: Copia este descriptor para crear uno nuevo

source: Copy
es: Copiar

source: Next
es: Siguiente

source: Deploy
es: Implementar

source: Deployment History of Artifact
es: Historial de implementación del artefacto

source: No deployment Record
es: Sin registro de implementación

source: No used deployment descriptor.
es: Ningún descriptor de implementación usado.

source: Delete
es: Eliminar

source: Save the deployment descriptor
es: Guarde el descriptor de implementación

source: Save
es: Guardar

source: Artifact Info:
es: Información del artefacto:

source: Project Info:
es: Información del proyecto:

source: Generate Deployable
es: Generar implementable

source: Project Selected
es: Proyecto seleccionado

source: Generate Classes Only
es: Solo generar clases

source: Import
es: Importar

source: Name
es: Nombre

source: Select File
es: Seleccionar archivo

source: Select
es: Seleccionar

source: Parent Folder
es: Carpeta principal

source: Decision table already exist. Please select one of the following actions
es: La tabla de decisiones ya existe. Seleccione una de las siguientes acciones

source: Select a Revision of
es: Seleccione una revisión de

source: Size
es: Tamaño

source: Action
es: Acción

source: Remove
es: Eliminar

source: Import from zip file
es: Importar desde archivo ZIP

source: Synchronize external changes to {{0}}
es: Sincronizar los cambios externos a {{0}}

source: Lock Artifact
es: Bloquear artefacto

source: Informational lock tag (optional)
es: Etiqueta de bloqueo informativo (opcional)

source: Artifact Rename
es: Renombrar artefacto

source: Project
es: Proyecto

source: Artifact
es: Artefacto

source: Action Types
es: Tipos de acción

source: After Date
es: Después de la fecha

source: Before Date
es: Antes de la fecha

source: LogFile
es: Archivo de registro

source: Apply
es: Aplicar

source: Audit Trail
es: Seguimiento de auditoría

source: Loading...
es: Cargando...

source: Search for...
es: Buscar...

source: No accessible artifacts in this project.
es: No hay artefactos accesibles en este proyecto.

source: No Artifact matches the search criteria.
es: Ningún artefacto coincide con los criterios de búsqueda.

source: Export
es: Exportar

source: You are editing version
es: Está editando la versión

source: This artifact has remote changes
es: Este artefacto tiene cambios remotos

source: You are editing the latest version
es: Estás editando la última versión

source: Artifact Type:
es: Tipo de artefacto:

source: Validate
es: Validar

source: Verify
es: Verificar

source: Commit
es: Confirmar

source: Undo
es: Deshacer

source: Redo
es: Volver a hacer

source: Analyze
es: Analizar

source: Synchronize
es: Sincronizar

source: This artifact contains binary content and cannot be displayed.
es: Este artefacto contiene contenido binario y no se puede mostrar.

source: Last modified
es: Última modificación

source: Version
es: Versión

source: Implementation path
es: Ruta de implementación

source: Enabled
es: Habilitado

source: Comments
es: Comentarios

source: Set cell description...
es: Establecer descripción de celda...

source: Id
es: Identificador

source: Priority
es: Prioridad

source: Set rule description...
es: Establecer descripción de regla...

source: Select DateTime
es: Seleccionar fecha y hora

source: Single Row Execution
es: Ejecución de una sola fila

source: Add Column
es: Agregar columna

source: Add Row
es: Agregar fila

source: Show All
es: Mostrar todo

source: Go to:
es: Ir a:

source: Show Pages
es: Mostrar páginas

source: Decision Table
es: Tabla de decisiones

source: Exception Table
es: Tabla de excepciones

source: Fill from SB Schema
es: Rellenar a partir de esquema SB

source: Edit schema:
es: Editar esquema:

source: Save
es: Guardar

source: Edit Schema
es: Editar esquema

source: Change Look and Feel
es: Cambiar el aspecto

source: Default
es: Predeterminado

source: Default Dark
es: Oscuro predeterminado

source: Blue
es: Azul

source: Fresh
es: Reciente

source: Dark
es: Oscuro

source: Bootstrap
es: Arranque

source: Range Entry
es: Entrada de rango

source: Entry Value
es: Valor de la entrada

source: Entry Description
es: Descripción de la entrada

source: Lower Value
es: Valor inferior

source: Upper Label
es: Etiqueta superior

source: Include lower value
es: Incluir valor inferior

source: Upper Value
es: Valor superior

source: Include upper value
es: Incluir valor superior

source: Add domain entry.
es: Agregue una entrada de dominio.

source: Delete domain entry.
es: Elimine la entrada de dominio.

source: Create duplicate domain entry.
es: Cree una entrada de dominio duplicada.

source: Configuration
es: Configuración

source: Domain description
es: Descripción del dominio

source: Domain type
es: Tipo de dominio

source: Inherits form...
es: Se hereda desde...

source: Project Details
es: Detalles del proyecto

source: Number of Artifacts
es: Número de artefactos

source: Project Size
es: Tamaño del proyecto

source: Project Path
es: Ruta del proyecto

source: Latest Operation Performed (User)
es: Última operación realizada (usuario)

source: Checkout By
es: Checkout de

source: Commit By
es: Confirmación de

source: Validate By
es: Validación de

source: Sync By
es: Sincronización de

source: Build By
es: Compilado por

source: Latest Operation Performed (Time)
es: Última operación realizada (hora)

source: Checkout Time
es: Hora de checkout

source: Commit Time
es: Hora de confirmación

source: Validate Time
es: Hora de validación

source: Sync Time
es: Hora de sincronización

source: Build Time
es: Hora de compilación

source: Statistics
es: Estadísticas

source: Total Commits
es: Confirmaciones totales

source: Total Approvals
es: Aprobaciones totales

source: Total Rejections
es: Rechazos totales

source: Total Deployments
es: Implementaciones totales

source: Copyright
es: Derechos de autor

source: TIBCO Software Inc. All rights reserved. Proprietary and Confidential.
es: TIBCO Software Inc. Todos los derechos reservados. Bajo propiedad y confidencial.

source: Select repository to reference in AMS
es: Seleccionar repositorio para referenciar en AMS

source: Select directory to be the root of the AMS project.
es: Seleccionar directorio para ser la raíz del proyecto AMS.

source: Change password for {{username}}
es: Cambiar contraseña para {{username}}

source: Password
es: Contraseña

source: Confirm password
es: Confirmar contraseña

source: Passwords must match
es: Las contraseñas deben coincidir

source: Change password
es: Cambiar contraseña

source: Add new user
es: Agregar nuevo usuario

source: Username
es: Nombre de usuario

source: Unique username is required
es: Se requiere un nombre de usuario único

source: Add user
es: Agregar usuario

source: Users
es: Usuarios

source: Projects
es: Proyectos

source: A comma separated list of artifact paths
es: Una lista separada por comas de rutas de artefactos

source: No project selected
es: Ningún proyecto seleccionado

source: Please select a project to view its artifacts.
es: Seleccione un proyecto para ver sus artefactos.

source: View Content
es: Ver contenido

source: Create New Artifact Group
es: Crear nuevo grupo de artefactos

source: New Group Name:
es: Nuevo nombre de grupo:

source: Group name can only consists of alphabets, numbers, underscore and space between words. Leading and trailing spaces will be neglected.
es: El nombre del grupo solo puede contener caracteres alfabéticos, números, guion bajo y espacio entre palabras. Los espacios iniciales y finales se descartarán.

source: File type/name filter (optional):
es: Filtro de tipo/nombre de archivo (opcional):

source: OK
es: ACEPTAR

source: Edit Artifact Group
es: Editar grupo de artefactos

source: Import Project
es: Importar proyecto

source: Select File
es: Seleccionar archivo

source: Create ACL
es: Crear ACL

source: Navigation Style
es: Estilo de navegación

source: Refresh All Projects
es: Actualizar todos los proyectos

source: Change the navigation style
es: Cambie el estilo de navegación

source: Create a new artifact
es: Crea un nuevo artefacto

source: Check out additional artifacts
es: Checkout de artefactos adicionales

source: Create a new project
es: Crear un nuevo proyecto

source: Checkout Project
es: Checkout del proyecto

source: Recently Opened
es: Abierto recientemente

source: Recently Opened Artifacts
es: Artefactos abiertos recientemente

source: Group Contents
es: Contenido del grupo

source: ARTIFACT GROUPS
es: GRUPOS DE ARTEFACTO

source: The group with name {{groupName}} already exists.
es: El grupo con el nombre {{groupName}} ya existe.

source: Group name is {{0}}required{{1}}.
es: El nombre del grupo es {{0}}obligatorio{{1}}.

source: Create New Artifact Group
es: Crear nuevo grupo de artefactos

source: Create a new artifact group
es: Crear un nuevo grupo de artefactos

source: Toggle Show Group Contents
es: Contenido de Cambiar mostrar grupo

source: Toggle Show Group
es: Cambiar mostrar grupo

source: There are no unread notifications.
es: No hay notificaciones sin leer.

source: Additional details
es: Detalles adicionales

source: Mark notification as read
es: Marcar la notificación como leída

source: Property
es: Propiedad

source: Severity
es: Gravedad

source: Time Stamp
es: Marca de hora

source: Details
es: Detalles

source: Build version
es: Versión de compilación

source: Build date
es: Fecha de compilación

source: Commit info
es: Confirmar información

source: Copy notification details to clipboard
es: Copiar detalles de la notificación al portapapeles

source: Deploy Artifact
es: Implementar artefacto

source: Select Environment
es: Seleccionar entorno

source: Deploy Comments
es: Implementar comentarios

source: Add deploy comments...
es: Agregar comentarios a la implementación...

source: Committed with comment
es: Confirmado con comentario

source: The commit is stale and cannot be approved until the author synchronize with the repository and commit again. You can still reject it.
es: La confirmación está obsoleta y no se puede aprobar hasta que el autor se sincronice con el repositorio y vuelva a confirmar. Todavía puede rechazarla.

source: Add review comments...
es: Agregar comentarios de revisión...

source: Approve
es: Aprobar

source: Reject
es: Rechazar

source: Withdraw
es: Retirar

source: Delegate
es: Delegar

source: Committed
es: Confirmado

source: Up to date
es: Actualizado

source: Modified artifacts are selected by default
es: Los artefactos modificados se seleccionan de forma predeterminada

source: Delegate Commit
es: Delegar Confirmación

source: Select Role/s To Delegate To
es: Seleccionar roles a los cuales delegar

source: Dashboard
es: Panel de control

source: Workspace
es: Espacio de trabajo

source: Settings
es: Configuración

source: Management
es: Administración

source: TIBCO Cloud Events WebStudio Notifications
es: Notificaciones de TIBCO Cloud Events WebStudio

source: TIBCO Cloud Events WebStudio Help
es: Ayuda de TIBCO Cloud Events WebStudio

source: Help
es: Ayuda

source: API Documentation
es: Documentación de API

source: Switch to Classic View
es: Cambiar a la vista clásica

source: Notifications
es: Notificaciones

source: Profile
es: Perfil

source: Log Out
es: Cerrar sesión

source: Finish
es: Finalizar

source: Welcome back
es: Le damos la bienvenida de nuevo

source: total unresolved item(s)
es: total de elementos sin resolver

source: total deployable artifact(s)
es: artefacto total desplegable

source: What would you like to do today?
es: ¿Qué le gustaría hacer hoy?

source: Project Snapshot
es: Instantánea del proyecto

source: There are unresolved worklist item(s)
es: Hay elementos de la lista de trabajo sin resolver

source: There are deployable artifact(s)
es: Hay artefactos implementables

source: Project size
es: Tamaño del proyecto

source: Total number of checked out artifacts
es: Número total de artefactos en checkout

source: Last commit by
es: Última confirmación de

source: Last commit time
es: Última hora de confirmación

source: No commits found for this project
es: No se han encontraron confirmaciones para este proyecto

source: Project is not yet checked out, no additional details are available.
es: El proyecto aún no está en checkout, no hay detalles adicionales disponibles.

source: MORE DETAILS
es: MÁS DETALLES

source: DELETE PROJECT
es: ELIMINAR PROYECTO

source: CHECKOUT PROJECT
es: CHECKOUT DEL PROYECTO

source: Are you ABSOLUTELY sure you want to delete project
es: ¿Está ABSOLUTAMENTE seguro de que quiere eliminar un proyecto?

source: This action {{0}}cannot{{1}} be undone. This will permanently remove {{0}}ALL{{1}} data for project{{0}}{{input}}{{1}}.The deletion is {{0}}unrecoverable{{1}}. {{2}} {{2}} Please type the name of this project to confirm the deletion.
es: Esta acción {{0}}no se puede{{1}} deshacer. Esto eliminará permanentemente {{0}}TODOS{{1}} los datos para el proyecto{{0}}{{input}}{{1}}. La eliminación {{0}}no se puede recuperar{{1}}. {{2}} {{2}} Escriba el nombre de este proyecto para confirmar la eliminación.

source: There are no visible projects. Go to {{0}}Settings > Projects Configuration{{1}} to make projects visible here.
es: No hay proyectos visibles. Vaya a {{0}}Configuración > Configuración de Proyectos{{1}} para que los proyectos sean visibles aquí.

source: Select an artifact from the Artifact Explorer
es: Seleccionar un artefacto del explorador de artefactos

source: To begin, select an artifact from the Artifact Explorer or check out additional artifacts by clicking the button below.
es: Para comenzar, seleccione un artefacto en el explorador de artefactos o haga checkout de artefactos adicionales haciendo clic en el botón de abajo.

source: No Visit History
es: Sin historial de visitas

source: OPEN EDITORS
es: EDITORES ABIERTOS

source: Welcome to the TIBCO
es: Le damos la bienvenida a TIBCO

source: You don’t have any apps yet
es: Aún no tiene ninguna aplicación

source: Get started by creating or uploading your apps.
es: Comience creando o cargando sus aplicaciones.

source: We will keep them here for you.
es: Los mantendremos aquí para usted.

source: You have not checked out any artifacts
es: No ha hecho checkout de ningún artefacto

source: Get started by checking out some artifacts into your workspace
es: Comience haciendo checkout de algunos artefactos en el espacio de trabajo

source: There are no projects to which you have access.
es: No hay proyectos a los que tenga acceso.

source: Please contact your administrator for permissions to view existing projects or create new ones.
es: Póngase en contacto con su administrador para obtener permisos para ver proyectos existentes o crear otros nuevos.

source: After that, you can check out those projects to start browsing and editing.
es: Después de eso, puede hacer checkout de los proyectos para comenzar a buscar y editar.

source: Error: something is wrong
es: Error: algo va mal

source: Commit
es: Confirmar

source: Edit Artifact Info
es: Editar información del artefacto

source: Create
es: Crear

source: Project Name
es: Nombre del proyecto

source: Artifact Path
es: Ruta del artefacto

source: Already exists in project
es: Ya existe en el proyecto

source: Artifact Type
es: Tipo de artefacto

source: Metadata
es: Metadatos

source: Create New Top Level Artifact
es: Crear nuevo artefacto de nivel superior

source: Add field
es: Agregar campo

source: Simple
es: Sencillo

source: Expression
es: Expresión

source: Remove field
es: Eliminar campo

source: Action
es: Acción

source: Empty Menu
es: Menú vacío

source: Synchronize Artifact
es: Sincronizar artefacto

source: Apply repository changes between revisions {{0}} and {{1}} to your working copy
es: Aplique cambios de repositorio entre las revisiones {{0}} y {{1}} a su copia de trabajo

source: Strategy
es: Estrategia

source: Strategy Selection
es: Selección de estrategia

source: merge
es: combinar

source: latest
es: último

source: No change was made to the working copy, simply use the latest version to replace your working copy.
es: No se realizó ningún cambio en la copia de trabajo, simplemente use la última versión para sustituir su copia de trabajo.

source: working
es: de trabajo

source: Reset
es: Restablecer

source: Conflict
es: Conflicto

source: Show Change Set
es: Mostrar conjunto de cambios

source: You have merge conflicts, please resolve them first.
es: Tiene conflictos de fusión, resuélvalos primero.

source: Mine
es: Mío

source: Result
es: Resultado

source: AMS Revision
es: Revisión de AMS

source: Condition
es: Condición

source: Schema
es: Esquema

source: Action
es: Acción

source: We already have the deployment descriptor with the same configuration.
es: Ya tenemos el descriptor de implementación con la misma configuración.

source: Target Type
es: Tipo de destino

source: StreamBase Server URI
es: URI del servidor StreamBase

source: StreamBase Service Name
es: Nombre del servicio StreamBase

source: Target StreamBase Operator
es: Operador StreamBase de destino

source: Status
es: Estado

source: Revision
es: Revisión

source: Initiator
es: Iniciador

source: Initiate Time
es: Iniciar tiempo

source: Complete Time
es: Hora de finalización

source: Duration
es: Duración

source: Failure Reason
es: Motivo del error

source: Cancel Deployment
es: Cancelar la implementación

source: No problems/warnings have been detected in this artifact so far.
es: No se han detectado problemas/advertencias en este artefacto hasta ahora.

source: Test Data Coverage
es: Cobertura de los datos de prueba

source: Select Argument
es: Seleccionar argumento

source: Select TestData
es: Seleccionar TestData

source: Table Analyzer
es: Analizador de tablas

source: Range
es: Rango

source: lower..
es: inferior..

source: upper..
es: superior..

source: Some of the artifacts being imported are invalid.
es: Algunos de los artefactos que se importan no son válidos.

source: Please remove the invalid artifacts or click \'Next\' to make additional changes
es: Elimine los artefactos no válidos o haga clic en \'Siguiente\' para realizar cambios adicionales

source: Create Project
es: Crear proyecto

source: Import from SCM
es: Importar desde SCM

source: In Progress
es: En curso

source: Show more filter options
es: Mostrar más opciones de filtro

source: Hide filter options
es: Ocultar opciones de filtro

source: Recent User Activity
es: Actividad reciente del usuario

source: You can filter the timeline based on the activity type
es: Puede filtrar la línea de tiempo en función del tipo de actividad

source: Search for recent activity
es: Buscar actividad reciente

source: No recent activity
es: No hay actividad reciente

source: Show only unresolved/deployable items
es: Mostrar solo elementos sin resolver/implementables

source: Show only deployable items
es: Mostrar solo elementos implementables

source: Today
es: Hoy

source: End of activity
es: Fin de actividad

source: We could not find any AMS user profile connected with your {{0}} account. Please either sign in your existing AMS account or create a new AMS account and it will be connected to your {{0}} account automatically.
es: No pudimos encontrar ningún perfil de usuario de AMS conectado con su cuenta {{0}}. Regístrese en su cuenta AMS existente o cree una nueva cuenta AMS y se conectará a su cuenta {{0}} automáticamente.

source: We could not find any AMS user profile connected with your {{0}} account. Please sign in your AMS account and it will be automatically connected to your {{0}} account. If you do not have an AMS account, please contact your administrator.
es: No pudimos encontrar ningún perfil de usuario de AMS conectado con su cuenta {{0}}. Inicie sesión en su cuenta de AMS y se conectará automáticamente a su cuenta {{0}}. Si no tiene una cuenta AMS, póngase en contacto con su administrador.

source: Sign In
es: Iniciar sesión

source: Sign Up
es: Registrarse

source: Sign in with
es: Iniciar sesión con

source: Welcome to
es: Le damos la bienvenida a

source: VERSION
es: VERSIÓN

source: Role Management
es: Administración de roles

source: Users
es: Usuarios

source: No user is assigned with this role.
es: Ningún usuario tiene asignado este rol.

source: Type
es: Tipo

source: Action
es: Acción

source: Instance
es: Instancia

source: Allow
es: Permitir

source: User Management
es: Administración de usuarios

source: Add new user
es: Agregar nuevo usuario

source: Select user:
es: Seleccionar usuario:

source: Enabled:
es: Habilitado:

source: Delete selected user
es: Eliminar usuario seleccionado

source: Permission Management
es: Administración de permisos

source: Users
es: Usuarios
