Repository: kagrawal-tibco/svnToGit
Catalog: designtime/webstudio/ui/src/locale/messages_*.xlf
Languages: es

source: Import a project from an EAR file
es: Importar un proyecto desde un archivo EAR

source: Project is not checked out, no additional details are available
es: El proyecto no está en checkout, no hay detalles adicionales disponibles

source: Click Confirm to delete project {{projectName}} from the workspace. You can recover the deletion if this project is already in the repository. However, any local changes will be lost.
es: Haga clic en Confirmar para eliminar el proyecto {{projectName}} del espacio de trabajo. Puede recuperar la eliminación si este proyecto ya está en el repositorio. Sin embargo, cualquier cambio local se perderá.

source: Click Confirm to delete {{0}} '{{1}}' from the workspace. You can recover the deletion if this {{2}} is already in the repository. However, any local changes will be lost.
es: Haga clic en Confirmar para eliminar {{0}} '{{1}}' del espacio de trabajo. Puede recuperar la eliminación si este {{2}} ya está en el repositorio. Sin embargo, cualquier cambio local se perderá.

source: Unable to load the editor interface. Reason:
es: No se puede cargar la interfaz del editor. Motivo:

source: An error has been detected in the browser.Before continuing, we recommend that you save any unsaved work. Error message:
es: Se ha detectado un error en el navegador. Antes de continuar, le recomendamos que guarde cualquier trabajo no guardado. Mensaje de error:

source: Export Artifacts from -
es: Exportar artefactos de:

source: Unrecognizable auth action:
es: Acción de autenticación irreconocible:

source: Authentication type is not file. Hence, this settings is not available.
es: El tipo de autenticación no es un archivo. Por lo tanto, esta configuración no está disponible.

source: Invalid time value.
es: Valor de tiempo no válido.

source: Only alphabetic characters, digits, -, and _ are allowed.
es: Solo se permiten caracteres alfabéticos, dígitos, guiones altos y guiones bajos.

source: Invalid hostname or port number.
es: Nombre de host o número de puerto no válido.

source: Only alphabetic characters, digits, -, and _ are allowed. Only / can be used as separator and only alphabetic characters and digits can be used as leading characters. A suffix starting with '.' is optional
es: Sólo se permiten caracteres alfabéticos, dígitos, guiones altos y guiones bajos. Solo puede usarse como separador la barra inclinada y solo pueden usarse como caracteres iniciales los caracteres alfabéticos y los dígitos. Un sufijo que comienza por '.' es opcional

source: Only alphabetic characters, digits and _ are allowed. Only / can be used as separator and only alphabetic characters can be used as leading characters. Length limit is 64 characters
es: Sólo se permiten caracteres alfabéticos, dígitos y guiones bajos. Solo puede usarse como separador la barra inclinada y solo pueden usarse como caracteres iniciales los caracteres alfabéticos. El límite de longitud es de 64 caracteres

source: Only alphabetic characters, digits, -, and _ are allowed. Only / can be used as separator and only alphabetic characters and digits can be used as leading characters. An extension suffix starting with '.' is required
es: Sólo se permiten caracteres alfabéticos, dígitos, guiones altos y guiones bajos. Solo puede usarse como separador la barra inclinada y solo pueden usarse como caracteres iniciales los caracteres alfabéticos y los dígitos. Un sufijo de extensión que comienza por '.' es obligatorio

source: Only alphabetic characters, digits, -, and _ are allowed. Only / can be used as separator and only alphabetic characters and digits can be used as leading characters.
es: Sólo se permiten caracteres alfabéticos, dígitos, guiones altos y guiones bajos. Solo puede usarse como separador la barra inclinada y solo pueden usarse como caracteres iniciales los caracteres alfabéticos y los dígitos.

source: Artifact content is the same. Please upload a different artifact.
es: El contenido del artefacto es el mismo. Cargue un artefacto diferente.

source: Uploader is not found. Something must be wrong.
es: No se ha encontrado el cargador. Algo debe estar mal.

source: Unable to parse {{name}} because:
es: No se puede analizar {{name}} porque:

source: LHS and RHS are both deleted, choose whether keep the deleted checked-out artifact
es: LHS y RHS están eliminados, elija si desea mantener el artefacto en checkout eliminado

source: LHS is deleted, choose whether keep the deleted checked-out artifact
es: LHS se elimina, elija si desea mantener el artefacto en checkout eliminado

source: RHS is deleted, choose whether keep the deleted checked-out artifact
es: RHS se elimina, elija si desea mantener el artefacto en checkout eliminado

source: Merge the repository changes with your local changes, leaving the results in your working copy. You may need to resolve conflicts.
es: Combine los cambios del repositorio con sus cambios locales, dejando los resultados en su copia de trabajo. Es posible que necesite resolver conflictos.

source: Unknown status: {{currentStrategy}}, something must be wrong
es: Estado desconocido: {{currentStrategy}}, algo debe estar mal

source: This Shall not be invoked if not in merge mode
es: No se invocará si no está en modo de fusión

source: No need to sync DELETED changes, it shall be resolved automatically
es: No es necesario sincronizar los cambios ELIMINADOS, se resolverá automáticamente

source: Discard working copy
es: Descartar copia de trabajo

source: Keep it as newly added
es: Mantenerlo como recientemente agregado

source: Revert the deletion
es: Revertir la eliminación

source: Keep the deletion
es: Mantener la eliminación

source: Revert the addition
es: Revertir la adición

source: Keep the artifact as a checkout from repository
es: Mantener el artefacto como un checkout del repositorio

source: Discard your local changes, replacing your local working copy with revision
es: Descartar los cambios locales, sustituyendo la copia de trabajo local con revisión

source: Merge the repository changes with your local changes, leaving the results in your working copy. You may need to resolve conflicts.
es: Combine los cambios del repositorio con sus cambios locales, dejando los resultados en su copia de trabajo. Es posible que necesite resolver conflictos.

source: Artifact{{name}} was deleted in the repository. Do you want to discard your working copy or keep it as a newly added artifact?
es: El artefacto{{name}} se eliminó en el repositorio. ¿Desea descartar su copia de trabajo o conservarla como un artefacto recientemente agregado?

source: Artifact {{name}} was updated in the repository while it is deleted locally. Do you want to revert your local deletion?
es: El artefacto {{name}} se actualizó en el repositorio mientras se eliminaba localmente. ¿Quiere revertir la eliminación local?

source: Artifact {{name}} was added in both the repository and your working copy. Do you want to revert your addition?
es: Se agregó el artefacto {{name}} en el repositorio y en la copia de trabajo. ¿Quiere revertir la adición?

source: No WebSocket connection established, please refresh browser and try again.
es: No se ha establecido una conexión WebSocket, actualice el navegador y vuelva a intentarlo.

source: Unable to enqueue at this moment.
es: No se puede poner en cola en este momento.

source: Invalid command: {{cmd}}
es: Comando no válido: {{cmd}}

source: Fail to create session.
es: Error al crear la sesión.

source: Invalid filter expression
es: Expresión de filtro no válida

source: This artifact/project/folder cannot be added to {{groupname}} group.
es: Este artefacto/proyecto/carpeta no se puede agregar al grupo {{groupname}}.

source: Error while editing artifact group
es: Error al editar el grupo de artefactos

source: Duplicate artifact error
es: Error de artefacto duplicado

source: This file type cannot be edited
es: Este tipo de archivo no se puede editar

source: Error retrieving group artifacts for group {{groupname}}. Try refreshing all artifacts
es: Error al recuperar los artefactos de grupo para el grupo {{groupname}}. Intente actualizar todos los artefactos

source: Only alphabetic characters, digits, -, and _ are allowed. Only / can be used as separator and only alphabetic characters and digits can be used as leading characters. A suffix starting with "." is optional
es: Sólo se permiten caracteres alfabéticos, dígitos, guiones altos y guiones bajos. Solo puede usarse como separador la barra inclinada y solo pueden usarse como caracteres iniciales los caracteres alfabéticos y los dígitos. Un sufijo que comienza por "." es opcional

source: Only alphabetic characters, digits, -, and _ are allowed. Only / can be used as separator and only alphabetic characters and digits can be used as leading characters. An extension suffix starting with "." is required
es: Sólo se permiten caracteres alfabéticos, dígitos, guiones altos y guiones bajos. Solo puede usarse como separador la barra inclinada y solo pueden usarse como caracteres iniciales los caracteres alfabéticos y los dígitos. Un sufijo de extensión que comienza por "." es obligatorio

source: Create more empty artifacts in Project
es: Crea más artefactos vacíos en el proyecto

source: Set the path and type of Artifact
es: Establecer la ruta y el tipo de artefacto

source: Edit Artifact
es: Editar artefacto

source: Edit artifact info or create additional artifacts in Project
es: Editar información del artefacto o crear artefactos adicionales en el proyecto

source: The ending date/time must be after the begin date/time
es: La fecha/hora de finalización debe ser posterior a la fecha/hora de inicio

source: User
es: Usuario

source: Time
es: Hora

source: Comment
es: Comentario

source: EditBuffer can not be null
es: EditBuffer no puede ser nulo

source: Expiration Date should be Greater than Effective Date.
es: La fecha de caducidad debe ser mayor que la fecha de vigencia.

source: Failed to remove column: there should be atleast one condition.
es: Error al eliminar la columna: debe haber al menos una condición.

source: Fail to remove rule
es: Error al eliminar la regla

source: Fail to duplicate rule
es: Error al duplicar la regla

source: Lower value cannot be greater than Upper value.
es: El valor inferior no puede ser mayor que el valor superior.

source: Invalid integer type entry:
es: Entrada de tipo entero no válida:

source: Invalid long type entry:
es: Entrada de tipo long no válida:

source: Invalid double type entry:
es: Entrada de tipo double no válida:

source: The filter related to this problem is now unavailable.
es: El filtro relacionado a este problema ya no está disponible.

source: Please confirm you want to delete role
es: Confirme que desea eliminar el rol

source: Please confirm you want to delete user {{user}} from role {{role}}
es: Confirme que desea eliminar el usuario {{user}} del rol {{role}}

source: Please confirm you want to remove permission {{perm}} from role {{name}}
es: Confirme que desea eliminar el permiso {{perm}} del rol {{name}}

source: No instance is permitted for this type and action.
es: No se permite ninguna instancia para este tipo y acción.

source: Select type and action to view the instances.
es: Seleccionar tipo y acción para ver las instancias.

source: Select a type to view actions.
es: Seleccione un tipo para ver las acciones.

source: Select a role to view permission types.
es: Seleccione un rol para ver los tipos de permisos.

source: This will delete the user
es: Esto borrará al usuario

source: Operator Setting Selected
es: Configuración del operador seleccionada

source: Notification Setting Selected
es: Configuración de notificación seleccionada

source: Error adding "{{0}}". A duplicate node with the same name already exists in the folder "{{1}}". You might continue to encounter this error until the duplicate file has been removed/renamed
es: Error al agregar "{{0}}". Ya existe en la carpeta un nodo duplicado con el mismo nombre "{{1}}". Puede seguir encontrando este error hasta que el archivo duplicado haya sido eliminado/renombrado

source: Should not add root to another node
es: No debe agregarse la raíz a otro nodo

source: Update an existing artifact group
es: Actualizar un grupo de artefactos existente

source: Unhandled ContextMenu Action:
es: Acción de ContextMenu no controlada:

source: Cannot create Rule Template Instance. No view defined in RT
es: No se puede crear una instancia de Rule Template. Ninguna vista definida en RT

source: {{name}}.rulefunction is not an virtual rule function.
es: {{name}}.rulefunction no es una rule function virtual.

source: Cannot sync external to non-checked-out artifact.
es: No se puede sincronizar el artefacto externo si el artefacto no está en checkout.

source: This newly added artifact does not have revision in the repository yet.
es: Este artefacto recién agregado aún no tiene revisión en el repositorio.

source: Click Confirm to delete {{0}} '{{1}}' from the workspace. You can recover the deletion if this {{2}}}} is already in the repository. However, any local changes will be lost.
es: Haga clic en Confirmar para eliminar {{0}} '{{1}}' del espacio de trabajo. Puede recuperar la eliminación si este {{2}}}} ya está en el repositorio. Sin embargo, cualquier cambio local se perderá.

source: You are reverting your local changes to artifact '{{name}}'. Click Confirm to proceed.
es: Está revirtiendo sus cambios locales al artefacto '{{name}}'. Haga clic en Confirmar para continuar.

source: You are discarding your local changes to artifact {{name}}. Click Confirm to proceed.
es: Estás descartando sus cambios locales al artefacto {{name}}. Haga clic en Confirmar para continuar.

source: The discarded artifact {{name}} is currently locked by you. Do you also want to release the lock?
es: El artefacto descartado {{name}} está actualmente bloqueado por usted. ¿También desea liberar el bloqueo?

source: No errors or warning found.
es: No se encontraron errores o advertencias.

source: This artifact is currently locked by user '
es: Este artefacto está actualmente bloqueado por el usuario '

source: Do you want to force the release of the lock?
es: ¿Desea forzar la liberación del bloqueo?

source: Artifact {{name}} is already checked-out, unable to checkout again.
es: El artefacto {{name}} ya está en checkout, no se puede volver a hacer checkout.

source: Invalid Email Id. Please enter a valid Email - Id
es: Identificador de correo electrónico no válido. Introduzca un identificador de correo electrónico válido

source: Artifacts deleted successfully
es: Artefactos eliminados correctamente

source: Checkout successful
es: Checkout correcto

source: Rename completed successfully.
es: Cambio de nombre completado correctamente.

source: Add to Recently Opened Artifacts successful
es: Agregar a los artefactos recientemente abiertos correctamente

source: Checkin Sucessful with Revision Id
es: Checkin correcto con identificador de revisión

source: Group Successfully Added
es: Grupo agregado correctamente

source: Group Successfully Deleted
es: Grupo eliminado correctamente

source: Deployment Config successfully deleted.
es: La configuración de implementación se ha eliminado correctamente.

source: Deployment Config successfully updated.
es: La configuración de implementación se ha actualizado correctamente.

source: Deployment Config successfully created.
es: La configuración de implementación se creó correctamente.

source: Deployable generated successfully.
es: Implementable generado correctamente.

source: Save successfully completed
es: Guardar correctamente completado

source: Rename completed successfully
es: Cambio de nombre completado correctamente

source: Selected artifacts reverted successfully
es: Los artefactos seleccionados se han revertido correctamente

source: User Preferences successfully updated
es: Preferencias de usuario actualizadas correctamente

source: Check Out Artifacts
es: Checkout de artefactos

source: Artifact is checked out
es: El artefacto está en checkout

source: Location:
es: Ubicación:

source: Artifact is not checked out
es: El artefacto no está en checkout

source: Artifact needs to be synchronized
es: El artefacto debe sincronizarse

source: Logged in
es: Conectado

source: Created artifact {{artifactPath}}
es: Artefacto creado {{artifactPath}}

source: Modified {{artifactPath}}
es: Modificado {{artifactPath}}

source: Committed {{artifactPath}}
es: Confirmado: {{artifactPath}}

source: Checked out artifacts in {{name}}
es: Artefactos con checkout en {{name}}

source: Approved {{artifactPath}}
es: Aprobado {{artifactPath}}

source: Approved {{artifactPath}} with the comment {{comment}}
es: Aprobado {{artifactPath}} con el comentario {{comment}}

source: Rejected {{artifactPath}}
es: Rechazado {{artifactPath}}

source: Rejected {{artifactPath}} with the comment {{comment}}
es: Rechazado {{artifactPath}} con el comentario {{comment}}

source: Validated artifact {{artifactPath}}
es: Artefacto validado {{artifactPath}}

source: Validated project {{project}}
es: Proyecto validado {{project}}

source: Reverted artifact {{artifactPath}}
es: Artefacto invertido {{artifactPath}}

source: Deleted artifact {{artifactPath}}
es: Artefacto eliminado {{artifactPath}}

source: Deleted project
es: Proyecto eliminado

source: Synchronized {{project}}
es: Sincronizado {{project}}

source: Logged out
es: Desconectado

source: Built and Deployed {{projectName}}
es: Compilado e implementado {{projectName}}

source: Generated deployable for {{projectName}}
es: Implementable generado para {{projectName}}

source: Created group {{path}}
es: Grupo creado {{path}}

source: Modified user settings
es: Configuraciones de usuario modificadas

source: Changed deployment configuration(s)
es: Configuraciones de implementación cambiadas

source: Delegated a worklist item
es: Delegación de un elemento de la lista de trabajo

source: Locked artifact {{path}}
es: Artefacto bloqueado {{path}}

source: Unlocked artifact {{path}}
es: Artefacto desbloqueado {{path}}

source: Modified security settings
es: Configuraciones de seguridad modificadas

source: User information has been modified
es: La información del usuario ha sido modificada

source: Imported {{artifact}}
es: Importado {{artifact}}

source: Exported {{path}}
es: Exportado {{path}}

source: Renamed artifact {{path}}
es: Artefacto renombrado {{path}}

source: Current Status
es: Estado actual

source: Artifact details:
es: Detalles del artefacto:

source: Change Password.
es: Cambie la contraseña.

source: Edit username or password.
es: Edite el nombre de usuario o la contraseña.

source: Delete User.
es: Elimine el usuario.

source: Acl updated successfully
es: Actualización correcta de ACL

source: Delete artifact group
es: Eliminar grupo de artefactos

source: User Group space locked
es: Espacio de grupo de usuarios bloqueado

source: This User Group already exists.
es: Este grupo de usuarios ya existe.

source: User do not have this permission
es: El usuario no tiene este permiso

source: User Dashboard space does not exist
es: El espacio del panel de control de usuario no existe

source: Workspace locked already
es: Espacio de trabajo ya bloqueado

source: Artifact [{{resourceName}}] was successfully imported
es: Artefacto [{{resourceName}}] importado correctamente

source: Error Importing Decision Table from Excel
es: Error al importar la tabla de decisiones de Excel

source: Failed importing artifact [{{resourceName}}]
es: Error al importar el artefacto [{{resourceName}}]

source: Resource already present :{{newResourcePath}}
es: Recurso ya existente: {{newResourcePath}}

source: Invalid file type. Please select excel file to import
es: Tipo de archivo no válido. Seleccione el archivo de Excel para importar

source: Conflict in this {{name}}
es: Conflicto en este {{name}}

source: Repository : {{repo}}
es: Repositorio: {{repo}}

source: Working Copy : {{copy}}
es: Copia de trabajo: {{copy}}

source: Update this {{name}}
es: Actualizar este {{name}}

source: Delete this {{name}}
es: Eliminar este {{name}}

source: {{entityName}} was set to different values in the repository and your working copy. Please select one of them to resolve the conflict.
es: {{entityName}} se estableció en diferentes valores en el repositorio y su copia de trabajo. Seleccione uno de ellos para resolver el conflicto.

source: {{entityName}} was deleted in {{first}} and {{entityName}} was updated in {{second}}.Please select the change to apply to your working copy.
es: {{entityName}} se eliminó en {{first}} y {{entityName}} se actualizó en {{second}}. Seleccione el cambio para aplicarlo a su copia de trabajo.

source: Authentication Failed, User is not logged in.
es: Error de autenticación, el usuario no ha iniciado sesión.

source: Commit
es: Confirmar

source: EAR for project {{0}} not present at deploy location, generate EAR.
es: El archivo EAR para el proyecto {{0}} no está presente en la ubicación de implementación, genere el archivo EAR.

source: Effective Date/Time
es: Fecha/hora de vigencia

source: Expiration Date/Time
es: Fecha/hora de caducidad

source: Beginning Date/time
es: Fecha/hora de inicio

source: Ending Date/time
es: Fecha/hora de finalización

source: Select All Matches:
es: Seleccionar todas la coincidencias:

source: Select All:
es: Seleccionar todo:

source: ADDED
es: AGREGADO

source: MODIFIED
es: MODIFICADO

source: DELETED
es: ELIMINADO

source: CLEAN
es: LIMPIAR

source: Artifact has {{errorsCount}} error(s) and {{warningsCount}} warning(s). Click for more information
es: El artefacto tiene {{errorsCount}} error(es) y {{warningsCount}} advertencia(s). Haga clic para obtener más información.

source: Work List
es: Lista de trabajo

source: Stale Commits
es: Confirmaciones obsoletas

source: Rejected Commits
es: Confirmaciones rechazadas

source: Approved Commits
es: Confirmaciones aprobadas

source: General Tasks
es: Tareas generales

source: Open an artifact (type a name...)
es: Abrir un artefacto (escriba un nombre...)

source: Group{{0}}Created
es: Grupo{{0}}creado

source: Modify Successful
es: Modificación correcta

source: Create Successful
es: Creación correcta

source: Delete Successful
es: Eliminación correcta

source: Synchronization Successful
es: Sincronización correcta

source: Updated User preferences
es: Preferencias de usuario actualizadas

source: Updated Notification preferences
es: Preferencias de notificación actualizadas

source: Updated Operator preferences
es: Preferencias de operador actualizadas

source: Concept
es: Concepto

source: Scorecard
es: Resultados

source: Domain
es: Dominio

source: Rule
es: Regla

source: Event
es: Evento

source: Channel
es: Canal

source: Domain Model
es: Modelo de dominio

source: Time Event
es: Evento de tiempo

source: Process
es: Proceso

source: Folder
es: Carpeta

source: Project Summary
es: Resumen del proyecto

source: Rule Template View
es: Vista de Rule Template

source: Rule Template Instance
es: Instancia de Rule Template

source: Rule Function Implementation
es: Implementación de Rule Function

source: Remove Column
es: Eliminar columna

source: Field Settings
es: Configuración de campo

source: Disable Row
es: Deshabilitar fila

source: Enable Row
es: Habilitar fila

source: Remove Row
es: Eliminar fila

source: Duplicate Row
es: Fila duplicada

source: Failed to add row: there should be atleast one condition.
es: Error al agregar la fila: debe haber al menos una condición.

source: Failed to clear column.
es: Error al borrar la columna.

source: Fail to add column: there should be atleast one condition.
es: Error al agregar la columna: debe haber al menos una condición.
